/obj/item/paper/pamphlet
	name = "pamphlet"
	icon_state = "pamphlet"
	show_written_words = FALSE

/obj/item/paper/pamphlet/radstorm
	name = "брошюра — \'Меры безопасности при радиационной буре и как не стать обезьяной\'"
	icon_state = "pamphlet_rad"
	default_raw_text = "На вашем судне сработала система раннего предупреждения о радиационной буре, \
		а поблизости нет ни одного технического шлюза, чтобы спрятаться? Не бойтесь, ведь НТ \
		по-настоящему думает обо всём! На всех уровнях судна установлено несколько общедоступных \
		убежищ, предназначенных исключительно для защиты ваших хрупких мясных тушек от превращения \
		в очередную медицинскую катастрофу! Пожалуйста, ознакомьтесь с подразделом 4.3 V2-3 вашего \
		руководства для сотрудников, чтобы узнать о надлежащих процедурах при получении избыточного \
		радиационного урона, если вы не успели добраться до убежища вовремя."


/obj/item/paper/pamphlet/violent_video_games
	name = "брошюра — \'Жестокие видеоигры и вы\'"
	icon_state = "pamphlet_violent_video_games"
	desc = "Брошюра, призывающая читателя вести сбалансированный образ жизни и заботиться о своём ментальном здоровье, продолжая при этом наслаждаться видеоиграми без вреда для себя. Вам она, скорее всего, не нужна..."
	default_raw_text = "Они не заставляют вас убивать людей. Вот, мы это сказали. А теперь возвращайтесь к работе!"

/obj/item/paper/pamphlet/gateway
	default_raw_text = "<b>Добро пожаловать в проект «Врата» от НаноТрейзен...</b><br>\
			Поздравляем! Если вы читаете это, значит, вы и ваше руководство решили, что вы \
			готовы посвятить себя колонизации бескрайних просторов далеких миров. Вы должны быть \
			готовы к целой жизни, полной приключений, небольшого количества упорного труда и \
			лучшей программы стоматологического страхования — но это далеко не всё, что может \
			предложить проект «Врата» от НаноТрейзен.<br><br>\
			Поскольку мы заботимся о вас, мы считаем честным убедиться, что вы осознаёте все риски, \
			прежде чем присоединиться к проекту. Все точки назначения были полностью исследованы \
			экспедиционной группой НаноТрейзен и сертифицированы как безопасные на все 100%. Мы даже \
			оставили для вас ящик космического пива вместе с базовыми материалами, которые понадобятся \
			для расширения операционной зоны НаноТрейзен и начала вашей новой жизни.<br><br>\
			<b>Основы работы Врат</b><br>\
			Все одобренные НаноТрейзен Врата работают по одним и тем же базовым принципам. Как и \
			ожидалось, они питаются от энергии оборудования локации, и без этого снабжения они не \
			могут безопасно функционировать, из-за чего устройство будет отклонять любые попытки активации.<br><br>\
			Как только Врата будут правильно настроены и получат достаточно энергии для работы, они \
			начнут поиск точки выхода. Время, необходимое для этого, может варьироваться, но интерфейс \
			Врат выдаст вам оценку с точностью до минуты. Потеря питания не прервёт процесс поиска. \
			Грипп не прервёт процесс поиска. Временные аномалии могут сделать оценку времени неточной, \
			но они не прервут процесс поиска.<br><br>\
			<b>Жизнь на той стороне</b><br>\
			Как только вы пройдёте сквозь Врата, вы можете почувствовать некоторую дезориентацию. Не паникуйте. \
			Это нормальный побочный эффект путешествия на огромные расстояния за короткий промежуток времени. \
			Вам следует осмотреть прилегающую территорию и попытаться найти ваш бесплатный ящик космического пива. \
			Наши экспедиционные группы обеспечили полную безопасность всех удалённых локаций, но в редких \
			случаях установленные ими обратные Врата могут быть не сразу заметны. Не паникуйте, если не можете \
			обнаружить обратные Врата. Начинайте колонизацию точки назначения.<br><br>\
			<b>Новый мир</b><br>\
			Как участник проекта «Врата» от НаноТрейзен, вы окажетесь на самом краю неизведанного космоса. \
			Несмотря на то, что полная безопасность гарантирована, участникам рекомендуется подготовиться \
			к суровым условиям окружающей среды."

/obj/item/paper/pamphlet/pathfinder_welcome
	name = "брошюра — \'Добро пожаловать на ECRSV Pathfinder!\'"
	desc = "Приветственная корпоративная брошюра для прибывших на ECRSV Pathfinder."
	icon_state = "pamphlet_pathfinder"
	default_raw_text = "<b>Добро пожаловать на флагман ваших возможностей — ECRSV Pathfinder!</b><br><br>\
		Pathfinder — гордость НаноТрейзен и одно из 10 лучших судов в нашем экспедиционном флоте! \
		Сами вы выбрали этот путь, или корпорация оптимизировала ваше распределение в рамках \
		программы стратегического кадрового планирования — мы абсолютно уверены, что высокоэффективный \
		экипаж Pathfinder примет вас в свою большую, дружную и строго регламентированную семью!<br><br>\
		<b>Памятка по безопасности для оптимизации вашей жизнедеятельности:</b><br>\
		1. В случае фиксации нештатной ситуации (разгерметизация, бунт, появление неизвестных \
		форм жизни) немедленно примите позу максимальной корпоративной лояльности и ожидайте \
		дальнейших распоряжений сотрудников службы безопасности. Не создавайте заторы в коридорах, \
		уступайте дорогу офицерам.<br>\
		2. Не прикасайтесь к оголённым проводам, светящимся артефактам, инженерам во время работы \
		и странным зелёным лужам в техобслуживании. Помните: любопытство вне рамок должностной \
		инструкции снижает квартальный бонус.<br>\
		3. Вдыхание газов, отличных от стандартной дыхательной смеси (O2/N2), строго не рекомендуется \
		и может аннулировать ваш полис медицинского страхования.<br><br>\
		Желаем вам продуктивной смены и достижения новых KPI на рубежах неизведанного космоса!<br><br>\
		<font size='1'>Внимание: Корпорация NanoTrasen (далее — Корпорация) не несёт юридической, \
		моральной или материальной ответственности за травмы, расщепление на атомы, мутации, \
		случайное клонирование или летальный исход, полученные на борту судна лицами, не являющимися \
		штатными сотрудниками с уровнем допуска не ниже командного. Чтение данного текста автоматически \
		означает ваше согласие с отказом от любых судебных исков.</font><br>\
		— Департамент по связям с общественностью НаноТрейзен, 2680."


/obj/item/paper/pamphlet/cybernetics
	name = "брошюра — 'Стартовое кибернетическое снаряжение от Synthman!'"
	icon_state = "pamphlet_cybernetics"
	desc = "Рекламная брошюра, призывающая к кибернетизации тела. К ней прикреплен какой-то образец."
	default_raw_text = "Присоединяйтесь к революции бодимодификаций уже сегодня! В этом редком эксклюзивном \
		предложении мы дарим вам БЕСПЛАТНЫЕ ОБРАЗЦЫ самых свежих и продвинутых кибернетических имплантов \
		от Synthman Co.! Вместе с этой брошюрой вы получаете в подарок сертифицированный NTSDA \
		высококлассный кибернетический имплант лимитированной серии абсолютно БЕСПЛАТНО! Модернизируйте \
		своё тело до ИДЕАЛА с помощью новой эксклюзивной линейки кибернетических продуктов Synthman! \
		Станьте масштабнее, сильнее и ЛУЧШЕ уже сегодня!"
	var/obj/item/organ/heart/cybernetic/sample


/obj/item/paper/pamphlet/cybernetics/Initialize(mapload)
	. = ..()
	sample = new(src)
	update_desc()

/obj/item/paper/pamphlet/cybernetics/update_desc(updates)
	. = ..()
	desc = "Брошюра, призывающая читателя установить себе импланты.[sample ? " К ней прикреплён \"образец\"..." : ""]"

/obj/item/paper/pamphlet/cybernetics/Destroy()
	QDEL_NULL(sample)
	return ..()

/obj/item/paper/pamphlet/cybernetics/Exited(atom/movable/gone, direction)
	. = ..()
	if(gone == sample)
		sample = null
		update_desc()

/obj/item/paper/pamphlet/cybernetics/attack_self(mob/user, modifiers)
	. = ..()
	to_chat(user, span_notice("Пока вы читаете брошюру, из неё выпадает бесплатный образец!"))
	sample.forceMove(drop_location())
	playsound(sample, 'sound/misc/splort.ogg', 50, vary = TRUE)

